Revit 2026 API

# BuiltInFailuresZoneFailures Class

---

Failures about Zone.

SystemObject Autodesk.Revit.DBBuiltInFailuresZoneFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ZoneFailures
```
```vb
Public NotInheritable Class ZoneFailures
```
```cpp
public ref class ZoneFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ZoneFailures = class end
```

The BuiltInFailuresZoneFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ZoneExistsNotEnclosedRoom | Zone has a room not enclosed. |
|  | ZoneNotEnclosed | Zone not enclosed totally. |
|  | ZonesOverlapWarning | Zone overlap to another zone or another room. |

#### Reference

Autodesk.Revit.DB Namespace